In [1]:
import numpy as np
import pandas as pd

In [24]:
data={
    "Name":['John','David','Peter'],
    'Age':[17,12,23],
    "City":['New Work','Paris','London']
}

df=pd.DataFrame(data)

In [25]:
df

    Name  Age      City
0   John   17  New Work
1  David   12     Paris
2  Peter   23    London

Selecting

In [ ]:
data=[
    ["John",28,"New York","18k"],
    ['Peter',18,'London',"16k"],
    ['Anna',19,'Berlin',"45k"],
    ["Jake",22,"Paris","30k"]
]

df2 = pd.DataFrame(data, columns=['Name','Age','City','Salary'])

ValueError: 4 columns passed, passed data had 3 columns

In [18]:
df2

    Name  Age      City Salary
0   John   28  New York   None
1  Peter   18    London   None
2   Anna   19    Berlin   None
3    18k  16k       45k    25k